9/data/attachments/dbf3e857d53fd937.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Joseph_positive_Friend_14015_7</nif:username>
            <nif:friendToBeRequested>soap_friends_b59bebe6-15b4-4d81-9415-b1a2745429cf</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>